---
archived: ~
categories: ~
keywords: BCPS,Общественные школы округа Бровард,Профилактика,Безопасность детей
published: ~
status: ~
title: Школы Броуарда
---

Моя работа с [Общественные школы округа Броуард](http://www.browardschools.com) охватывают два
год в 2005-2006 годах в качестве веб-мастера Управления программ профилактики.  Я разработал
и поддерживал свой сайт, работая со своей командой, чтобы продвигать безопасность детей, как это связано
в государственные школы округа Броуард.  Инструмент был основан вокруг
[Анакия](http://velocity.apache.org/engine/devel/anakia.html)