---
archived: ~
categories: ~
keywords: Веб-сайты сообщества
published: ~
status: ~
title: Управление недвижимостью
---

Моя работа в этой области охватывала 2000-2006 годы как разработчик программного обеспечения и веб-мастер, который
написал CMS-подобный сервис для хостинга сайтов сообщества, предлагаемых местной Собственностью
Управляющие компании.  Он взаимодействовал с программным обеспечением Tops для обеспечения онлайн-бухучета
данные для владельцев недвижимости, а также различные форумы для общения членов сообщества
друг с другом.  На своем пике мы разместили более 100 сайтов.  Технология была основана
включено `Линукс`, `mod_perl`, `httpd`, и `msyql`- типичный материал LAMP-stack.  Единственный роман
Кусок должен был хранить `SQL` инструкции в самой базе данных для последовательной детализации
к отдельным записям без жесткого кодирования `SQL`