---
archived: ~
categories: ~
keywords: Startup, Project WBS, потоковое видео
published: ~
status: ~
title: Видео
---

VDIO был родственным сайтом для RDIO (теперь тоже не существует), предназначенным для предоставления потокового видео онлайн. &mdash; в виде премиальных, недавно выпущенных блокбастеров фильмов &mdash; для своих потенциальных клиентов.  Мое участие в этом стартапе охватывало шестимесячный период в конце 2011 – начале 2012.  Моей главной задачей было разработать сценарий для продвижения `постгрескл` Раб с хозяином на разных континентах, следуя за Солнцем. Другие задачи, связанные с документированием и продвижением внутренних инструментов для их `Девопс`

VDIO был в конце концов заброшен в марте 2012 года его основателями и свернут в RDIO, который предоставил все финансирование для стартапа.
