---
acl: '@staff=rw, *=r'
categories: ~
dependencies: '*.md.ru api/index.md.ru'
keywords: wiki,jamstack,блог,безопасно,безопасно
status: черновик
title: SunStar Орион систем
---

[TOC]#sidebar

<div class="row">
<div class="col-lg-5">
<p>
	<span class="text-primary-emphasis"><img style="width:100px" src="../images/sunstar-orion-symbol-linear.png"><!-- Derived work from Dennis Moskowitz's original CC BySA v4.0 -->&nbsp;<em>Платформа Jamstack Wiki.</em></span>&trade;
</p>
<br>
<span class="text-white">SunStar Орион систем</span> &nbsp; является

&nbsp;

<p>
<ul class="list-group">
  <li class="list-group-item list-group-item-primary d-flex justify-content-between align-items-center">

[**невзломный**](security#separation-of-concerns-and-engineering-tradeoffs10)

:fa-lock:

</li>
  <li class="list-group-item list-group-item-secondary d-flex justify-content-between align-items-center">

[**неразрывной**](https://iconoclasts.blog/joe/apache-cms#:~:text=7%20years)

:fa-train:

</li>
  <li class="list-group-item list-group-item-success d-flex justify-content-between align-items-center">

**мобильный**

:fa-mobile:

</li>
  <li class="list-group-item list-group-item-info d-flex justify-content-between align-items-center">

[**пиковая производительность**](features)

:fa-rocket:

</li>
  <li class="list-group-item list-group-item-warning d-flex justify-content-between align-items-center">

**федеративный**

:fa-hexagon-nodes-bolt:

</li>
</ul>
</p>

&nbsp;

{# lede #}<span class="text-white">Корпоративная платформа Jamstack Wiki</span>&nbsp; для <b>создания, управления и доставки</b> статические веб-страницы с использованием технологии Jamstack для динамических функций в них{# lede #}. Для получения информации о ценах см. наш [Планы Ориона](plans).

&nbsp;

### Вот окупаемость инвестиций, ответственный за принятие решений :fa-chart-line:...

&nbsp;

<span class="text-white">Почему выбирают Орион? Платформа Jamstack Wiki, которая превосходит &mdash; и затраты намного меньше</span>

&nbsp;

То, что действительно отличает Orion, не просто еще одна вики-платформа &mdash; Это наша собственная технология Orion, проверенный в бою и запатентованный подход, который обеспечивает элегантный пользовательский опыт с непревзойденной безопасностью, надежностью и эффективностью.

&nbsp;

<span class="text-white">Ничто не принесет лучшей окупаемости инвестиций, чем Orion на рынке системы управления знаниями.</span>

&nbsp;

В отличие от продуктов, которые используют ваши конкуренты, Orion – это платформа, предназначенная для получения превосходной, обслуживаемой, конфиденциальной, но легко находимой корпоративной документации с самой богатой, но наиболее понятной, управляемой сетью связи / зависимости на рынке. Это превращает коллективный опыт вашей организации из обязательства, которое утекает в ваше самое долговременное конкурентное преимущество.

&nbsp;

<div class="accordion" id="how-so-container" style="background-color: transparent !important; color: black">
<div class="accordion-item" style="background-color: transparent !important; padding-bottom: 0px; border: none">
<div class="accordion-header" id="how-so-heading">
<button class="accordion-button collapsed" data-bs-toggle="collapse" data-bs-target="#how-so-target" aria-expanded="false" aria-controls="how-so-target">

#### Как это?

</button>
</div>

<div id="how-so-target" class="accordion-collapse collapse" aria-labelledby="how-so-heading" data-bs-parent="#how-so-container" style="background-color: transparent !important; border: none; color: black">

&nbsp;

<span class="text-white">Более безопасный и лучший продукт за меньшие деньги</span>

&nbsp;&nbsp;<a id="fn-1" href="#1">1</a>. Существенное снижение риска безопасности

&nbsp;&nbsp;<a id="fn-2" href="#2">2</a>. Реальная интеграция математики и данных с поиском и преобразованием ИИ

&nbsp;&nbsp;<a id="fn-3" href="#3">3</a>. Поддержка искусственного интеллекта

&nbsp;&nbsp;<a id="fn-4" href="#4">4</a>. Инструментарий обработки содержимого в наборе

&nbsp;&nbsp;<a id="fn-5" href="#5">5</a>. [<span class="text-white">Экономьте $100K / год</span>](https://www.atlassian.com/software/confluence/pricing) со [Корпоративное лицензирование Orion $0 за место / на веб-сайте](plans)

&nbsp;&nbsp;<a id="fn-6" href="#6">6</a>. [<span class="text-white">Экономия 50% в год</span>](https://www.atlassian.com/software/confluence/pricing) со [Бизнес-план Ориона](plans) над совместимым функцией Confluence Premium

&nbsp;

[^1]. Принятие Orion немедленно снижает риск серьезного инцидента с безопасностью; и спокойствие поставило вопросы больше вашему совету директоров, чем [дорогой полис страхования вымогателей](https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/) Вам никогда не нужно предъявлять претензии.

&nbsp;

[^2]. Отложить [преимущества безопасности](https://www.iconoclasts.blog/joe/wishful-thinking) и [ужесточение наказания](https://www.hipaajournal.com/what-are-the-penalties-for-hipaa-violations-7096/) для [нарушения конфиденциальности данных HIPAA](https://cybersecuritynews.com/how-the-atlassian-confluence-breach-rewrites-data-center-security-rules/)фундаментальный недостаток вики-подобных продуктов, кроме Orion, заключается в том, что они не обеспечивают **связную интеграцию / интерфейсы для включения и периодического обслуживания форматов файлов данных, созданных извне**. Тем не менее, сосредоточив внимание на нескольких стандартных форматах текста / исходного документа / данных, даже на самых сложных математических таблицах, графиках, диаграммах, картах и архитектурных диаграммах, которые **доступны для поиска и могут быть переведены с помощью ИИ** на любом из поддерживаемых естественных языков Ориона.

&nbsp;

Например, вы увидите **больше не потерянную производительность** для персонала, пытающегося получить периодически обновляемые, критически конфиденциальные сведения о конфигурации облачных активов Infosec. :fa-network-wired: заперта в скрыто помеченной, внешне сгенерированной таблице данных где-то в вашей текущей вики, и в разочаровании, обращаясь к товарищам по команде, которые также не помнят, где она находится. Который естественным образом увеличивает эволюционирующее время для менеджеров, и это происходит. Пока кто-то не помнит, но потому что таблица огромна, и они просто хотят, чтобы содержимое одного элемента в одном ряду, поэтому они должны получить его с помощью браузера и глазного яблока сканировать его вручную. Затем повторяйте процесс всякий раз, когда они обнаруживают, что данные infosec будут обновлены.[^HTML5].

&nbsp;

Кроме того, `YAML/JSON` даже не поддерживаются форматы импорта данных в Notion (или Confluence)!  Если вы не можете сгенерировать внешние древовидные данные в `CSV` таблица, все, что вы оставили, это пустые блоки страниц, с помощью которых вы можете тратить больше времени, потраченного на освоение нашей платформы Orion.

&nbsp;

Эта таблица Infosec, созданная извне :fa-network-wired: будет включен в вашу вики Ориона как **поисковый `CSV` файл**, прикрепленный к базовому документу снижения цен, который в противном случае отображает его во время сборки во встроенный `HTML5` стол.

&nbsp;

Они должны быть уведомлены, когда это прикреплено `CSV` изменен? Просто подпишитесь на `CSV` файл! После уведомления во время следующего посещения вики (а не по электронной почте) они могут пропустить встроенный `HTML5` визуализированную таблицу разметки и вместо этого непосредственно извлекать именно то, что им нужно от Orion's `JSON` строительство `CSV` вложение по стандарту `CLI` инструменты как `curl` и `jq`. **Ни одна другая вики не поддерживает этот рабочий процесс сегодня**.

&nbsp;

[^3]. <span class="text-white">`MCP` Это ripoff. `RAG` еще хуже. То, что вы хотите, это двусторонняя синхронизация управления версиями с `git`. Подключение локального решения агента ИИ вашей компании к вики-процессу вашей команды не становится безопаснее, проще или дешевле, чем с Orion.</span>

&nbsp;

**Своевременность, удобство, точность и точность в постоянном стремлении к единственному источнику достоверных данных играют важную роль в повышении производительности для наиболее ограниченных по времени сотрудников**. Вероятные последствия отсутствия этих функций, предназначенных только для Orion, заключаются в том, что ваши инженеры платформы будут <span class="text-white">**принудительно тратить $10-100K ежегодно на макет**</span> путем создания, создания, **документирования** и поддержки миниатюрных, внутренних веб-сайтов с `REST`-на основе интерфейсов к этим общим наборам данных, в качестве временного решения для ограниченного набора функций интеграции данных вашего поставщика вики с возможностью поиска и извлечения.

&nbsp;

В противоположность этому, Orion представит ваши ранее потерянные, сгенерированные извне детали инфосека :fa-network-wired: по требованию и **подготовьте их таким образом, чтобы их могли автоматизировать веб-агенты и агенты ИИ, которые предпочитают ваши таланты**. Непревзойденная щедрость и надежность. Хотите улучшить свой поиск, настроив вручную по вкусу, пока в конечном итоге не захотите `JSON` по `HTML5` в ваших результатах? Опять же, Orion доставляет (то же самое) `URL`, разные `Accept` заголовок.)[^уточнения]

&nbsp;

Другими словами, **поиск информации** является принципиально иным проблемным доменом, чем создание/изменение контента, но [На основе CRUD](https://crudly.ai/crud-app/) Вики приложения от наших конкурентов не делают это различие значимым способом. Кроме того, с дизайном Jamstack компании Orion, таксономии не рассматриваются как неуправляемые, родовые / эмергентные, динамически генерируемые после мысли, отбираемые из-за чрезмерного налогообложения `SQL` столы. Вместо этого они информируются с тщательным структурным планированием и последовательно внедряются в наследственную организацию опытными информационными архитекторами в вашей команде и нашей.[^разрастание].

&nbsp;

[^4]. **инструмент для курации контента** является важной особенностью Orion, а не возможностью допродаж. Наша база данных по вики-фактам является первой в отрасли &mdash; удобный для таких вещей, как управление согласованным брендингом имени или метаданные артефактов связанного программного обеспечения по всему веб-сайту с 1-строчным редактированием [Файл YAML](https://github.com/SunStarSys/www.iconoclasts.blog/blob/trunk/lib/facts.yml).

&nbsp;

Таким образом, вместо неизбежной энтропической ссылки, вращающейся врожденно к другим вики-продуктам, вы получаете **внутреннюю/внешнюю проверку ссылки** во время модификации страницы во время всеобъемлющего, `MIME`-тип основанный, пре-комит пропуск линтинга у Ориона `CMS` редактор. Мы также предоставляем каждому клиенту инфраструктуру отчетности для **перехвата устаревших внутренних/внешних ссылок по запросу**, даже если соответствующие страницы не были изменены в течение нескольких месяцев. Схемы так же легко синхронизировать с развивающимися изменениями в прозе разметки, потому что с интеграцией русалки Ориона **источники диаграмм встроены в прозу страницы**. Безболезненный рекурсивный поиск / замена для ремонта накопленного крыла встроен в `PCRE` поисковая система в `CMS`.

&nbsp;

С Orion ваша вики больше не ухудшается полезность для ваших команд; но становится **вознаграждающим ресурсом для их использования и улучшения.**  Кроме того, вам не нужно быть администратором вики, чтобы использовать эти инструменты &mdash; Почти каждый может добровольно участвовать в мероприятиях по уходу или, возможно, быть организационно делегированным для выполнения этой обязанности в качестве руководства команды.

&nbsp;

<span class="text-white">Измеримый рост окупаемости инвестиций в вашей организации – это последовательный, непрерывный эффект цветения совокупных возможностей садоводства и ухода, уникальных для нашей вики-платформы.</span>

&nbsp;

Кроме того, по мере того, как ваш сайт развивается до точки, где файлы или папки должны быть перемещены или удалены, Orion не только отслеживает перемещение местоположения, развертывая автоматизированные `HTTP` перенаправляет из исходных местоположений в новые цели, но также продолжает закрепить в правиле существующие `ACL`в оригинальных местах навечно. Это гарантирует, что ваш конфиденциальный контент остается защищенным от исторических поисков от несанкционированных пользователей в системе, которые в противном случае могли бы иметь прямой доступ к интерфейсам контроля версий Orion к источникам вашей вики.

&nbsp;

Вы когда-нибудь видели систему, которая может надежно интегрировать отфильтрованный контент / данные в независимые исходные файлы?  [**Orion может**](https://www.iconoclasts.blog/joe/)с полной поддержкой [**циклические взаимозависимости**](https://www.iconoclasts.blog/joe/dependencies) и контроль авторизации для каждого исходного файла.  Нет просто способа случайно (или злонамеренно) отмывать контент, контролируемый доступом, через его функциональность интеграции контента, и нет способа модифицировать контент / данные в таких файлах без этих изменений, связанных с одновременными сборками их зависимых файлов[^приложение].

&nbsp;

Конечно, это невозможно с такими продуктами, как Notion, потому что невозможно повторно восстановить существующую сгенерированную базу данных с обновленным внешним импортом файлов; вы должны удалить и заново создать всю базу данных (или, возможно, использовать сторонние инструменты). Удалив исходную базу данных, вы также **уничтожите все вики-ссылки и соответствующие списки уведомлений о просмотре пользователями**. "Неприятный" не начинает ее покрывать.

&nbsp;

Нет никого в отрасли, кто бы вложил эту большую доработку во все аспекты своего вики-продукта в качестве общего пакета.

&nbsp;

[^5]. Более того, Orion масштабируется вместе с вами по мере роста, особенно на уровне предприятия. The <span class="text-white">**$0 за лицензию на место и неограниченное количество веб-сайтов**</span> открывает новые возможности для контролируемого обмена знаниями и сотрудничества между командами, партнерами, веб-сайтами и даже всей планетой с помощью нашей федеративной платформы! Мы знаем, что для большинства клиентов только крошечная часть этих лицензий будет использоваться для редактирования страниц, но они могут использовать неограниченное количество "связан" учетные записи только для чтения в своих вики для обмена защищенной информацией через Интернет. Учетные записи, которым не требуется доступ к Orion `CMS` собственно- экономичная функция, уникальная для Orion как единственная поддерживаемая корпорацией **Enterprise Jamstack Wiki**.

&nbsp;

По мере того как корпоративный статус вашего персонала со временем меняется, Orion упрощает администраторам вики работу с соответствующими повторными авторизациями вики. Массовый поиск и замена при каждом явном `ACL` настройка на сайте, привязанном к учетной записи бывшего сотрудника, так же тривиально автоматизирована, как адаптация нового сотрудника или обновление существующего, путем их переноса в соответствующие группы авторизации контроля версий, которые разработала ваша команда[^владение].

&nbsp;

[^6]. с другими рыночными решениями, [без премиального плана вы сами](https://www.atlassian.com/software/confluence/resources/guides/premium-admin/manage-content-at-scale#what-is-content-manager).

&nbsp;

Наконец, мы адаптируем каждую установку к вашим конкретным требованиям и **всегда доступны для консультации и профессионального коучинга**, чтобы обеспечить максимальную отдачу от ваших инвестиций в наши продукты и услуги. **У вашей команды есть партнер в нас** с точки зрения обеспечения того, чтобы вы видели ожидаемый прирост производительности и удовлетворенность клиентов, связанную с Orion &mdash; предназначен для надежного, проверенного, совместного создания и обработки знаний; и простой, всеобъемлющий, точный поиск информации.

&nbsp;

##### Сноски

&nbsp;

[^HTML5]. (Истинная история!) Чтобы добавить оскорбление к травме, оказывается, что существующая вики-страница превращает содержимое страницы только в неявное приложение веб-браузера на основе JavaScript, а не в явное соответствие стандартам Ориона. `HTML5` документ. Это подразумевает, среди прочего, что даже если поисковая система вашей вики просматривает таблицы, которые вам нужны, вы не можете напрямую получить доступ к этим таблицам как к агентному загружаемому вики-контенту, если команда infosec не столкнется с проблемой последовательного удаления и повторного экспорта таблицы (как `CSV` вложения) всякий раз, когда данные обновляются.

&nbsp;

[^уточнения]. Не нашли сразу то, что искали в поисковых записях Ориона? Уточните текущий поиск с помощью фильтра поиска по материалу, который вы нашли; при необходимости повторите. Или нажмите на предложенное связанное ключевое слово, сгенерированное из найденного материала, чтобы сдвинуть поиск в смежном направлении. Или разверните область поиска до более высокого уровня в списке навигационных крошек каталога в верхнем конце страницы. Или переключиться на `PCRE` Regex поиск вместо Lucene естественный язык-stemmed Bareword матч популяризированный Гугл в свои годы формирования.

Предлагает ли Ваше текущее решение Вашему персоналу такой уровень возможностей поискового поиска? Конечно, нет, если это слияние или понятие.

&nbsp;

[^приложение]. Применение этой технологии к таблице infosec :fa-network-wired: ситуация: ваша команда может использовать его для интеграции и фильтрации Orion-pemalinked `CSV` вложение в свою собственную отдельную вики-страницу, и Orion будет следить за тем, чтобы контент на этой отдельной странице обновлялся всякий раз, когда таблица инфосека с постоянными ссылками :fa-network-wired: Это происходит не только тогда, когда вики-страница редактируется вручную. Как и в случае с другими вики-решениями.

&nbsp;

[^разрастание]. Orion имеет много инструментов для управления разрастанием вики; от создания динамических топологических ограничений до всей площадки `ACL`s, чтобы просто поддерживать **архивирование документов** &mdash; который является документом [`Status`](api/doc#-code-status-code-5) установка сигнала Ориона о том, что страница должна быть исключена из графа управления зависимостями; эффективное удаление связи со всеми индексами документов и перекрестными ссылками, а также инструктаж Ориона игнорировать ее в `CMS` списки каталогов, сохраняя файл как постоянную ссылку с возможностью поиска и архивируя копию этого файла в соответствующее местоположение текущего года/месяца с отметкой времени в другом месте вики.

&nbsp;

[^владение]. Фактически, в системе **не существует формального понятия владения страницами**. Контроль версий Orion просто отслеживает разрешенные пользователем наборы изменений персонала во время внесенных пользователем изменений, обеспечивая более естественную, коллегиальную корпоративную аккультурацию в отношении комбинированного продукта работы вики, чем в любой другой подобной системе. Блокировка страниц до учетных записей отдельных пользователей/"авторы" является анафемой коллаборативных идеалов вики, но, безусловно, можно двигаться вперед с явным `ACL` назначения заголовков на соответствующих страницах.

&nbsp;

-----

</div>
</div>
</div>

&nbsp;

#### Оставьте истощающие болевые точки прошлого позади...

&nbsp;

Для многих компаний Jira является удивительно эффективным инструментом для управления проектами. Однако со временем вы начинаете понимать, что [Конфлюенс просто помечается для поездки](https://projectmanagers.net/top-10-cons-disadvantages-of-using-confluence/)...

Если это резонирует, вы устали бросать больше хороших денег на плохие инвестиции?

&nbsp;

Не нужно тратить драгоценный капитал на [ухудшение производительности](https://www.reddit.com/r/Notion/comments/1rdals6/is_notion_getting_slower_or_is_it_just_me/)дорогой, [ненадежный](https://isdown.app/status/notion) Сервис SaaS, который не может выполнить свои обещания по повышению производительности? Другими словами, что-то вроде понятия?

Предпочитайте *grokability* такой системы, как Orion &mdash; организовано вокруг *документов с прикрепленными данными*; вместо *баз данных Содержания с прикрепленными документами*?

&nbsp;

Хотите более консервативный/суверенный подход, чем просто разоблачение всех ваших корпоративных секретов недобросовестным поставщикам ИИ и их недобросовестным моделям границ?

&nbsp;

### Орион создан для лидеров, которые отказываются селиться

&nbsp;

<div class="fade">

- :fa-school-flag: **Университетские лидеры** &mdash; Устраните плагиат в кампусе и обеспечьте безопасную совместную работу с открытым доступом с помощью совместного использования документов, курирования и онлайн-публикации с контролем версий. Превратите управление академическими знаниями в современное, доступное для аудита, [Открытая наука](https://www.iconoclasts.blog/joe/triple-products) Платформа.

</div>

&nbsp;

<div class="fade">
<center>
<img src="index.page/hipaa" style="width:25%">
</center>

- :fa-building-columns: **Здравоохранение, Правительство &amp; лица, принимающие решения в области ИТ** &mdash; Соответствие требованиям инфраструктуры FedRAMP, NIST 800-207 с нулевым доверием и HIPAA. Наслаждайтесь детализированными элементами управления доступом в репозитории управления версиями &mdash; все с безопасностью, совместимой с FIPS 140-3, и возможностью установки внутри вашего VPN.

</div>

&nbsp;

<div class="fade">

- :fa-cart-arrow-down: **Руководители по маркетингу** &mdash; Используйте быструю, глобальную, инновационную корпоративную платформу для корпоративных ресурсов веб-сайтов. Использование Orion в качестве мощной автономной CMS &mdash; безопасная, производительная и полностью отделенная от внешнего интерфейса доставка.

</div>

&nbsp;

<div class="fade">

- :fa-computer: **Технологические компании &amp; веб-агентства** &mdash; Замените небезопасные коммерческие вики, приручите горы документации по продуктам, клиентские сайты и даже двоичные загрузки. Отбирайте все с уверенностью, скоростью и историей версий.

</div>

&nbsp;

<div class="fade">

- :fa-compass-drafting: **Архитекторы высокой доступности &amp; Основные инженеры** &mdash; Избегайте одиночных точек отказа, встроенных в стеки LAMP на основе SQL. Реализуйте настоящую масштабируемость Jamstack: параллельные сборки, инкрементные обновления, глобальный охват POP и пиковая производительность, измеряемая в миллисекундах.

</div>

&nbsp;

<div class="fade">

- :fa-business-time: **Любой бизнес устал от экономики вики** &mdash; Откажитесь от дорогостоящих подписок на SaaS, хрупких бесплатных инструментов, которые истощают время персонала, и устаревших систем, которые замедляют работу вашей команды. Orion дает вам мощность предприятия за долю от общей стоимости владения (часто ниже 25 000 долларов США в год для полного использования на предприятии).

</div>

&nbsp;

Отсутствие привязки к поставщику &mdash; И мы докажем это*. Ваш контент живет в чистых Markdown и стандартных рабочих процессах управления версиями. Нет фирменных форматов. Никаких миграционных кошмаров.

&nbsp;

[Свяжитесь с нами](../contact) Бесплатное демо уже сегодня.

</div>
<div class="col-lg-6 border-start" style="border-color: #A9BDBD">
<a href="features"><img id="ad1" style="width:100%;margin-bottom:0px;margin-top:3px;" src="index.page/ad1"></a>

&nbsp;

&nbsp;

### Вот&nbsp;Почему,&nbsp;Молодые&nbsp;Академический&nbsp;:fa-orcid: / Полный&nbsp;Стек&nbsp;Разработчик&nbsp;:fa-stack-overflow: / Общедоступный&nbsp;Блогер&nbsp;:fa-blog:&nbsp;...

&nbsp;

Хотите сайт, который **безопасен по умолчанию**? Легко обновлять и управлять, скрывая сложность базовой системы управления версиями, но обеспечивая полную мощность, когда она действительно нужна?  Мгновенная публикация, когда это необходимо; плавная поэтапная сборка филиалов и настраиваемые детализированные рекламные акции для вашего производственного сайта, поскольку это соответствует предпочтительному рабочему процессу вашей команды.

&nbsp;

Если вы устали от лицензирования на место и выбора на ЦП, взвешивающих вас всякий раз, когда вам нужно исправить опечатку, [связаться с нами](/contact). Если вы отвечаете за курирование контента и ищете настраиваемую базу данных фактов для управления вашими внешними ссылками, или если вы укротитель львов с регулярным выражением для Десятилетиями накопленного устаревшего HTML-контента, или просто кого-то, недовольного другими вариантами на рынке и тем, как они функционируют в масштабе, у нас есть что-то действительно особенное, чтобы предложить вам.

&nbsp;

Никогда не иметь дело непосредственно с системой контроля версий или даже статическим генератором сайта, на вашем персональном компьютере зависит от вас. Онлайн-редактор CMS/IDE разработан и готов для **рабочего процесса только для браузера** в любое время.  В крайнем случае, даже мобильный (браузерный) интерфейс сделает это *мгновенно*.

&nbsp;

<div id="lightning">

![Молния](index.page/lightning)

</div>

<style type="text/css">

div#lightning img {width:100%}

</style>

&nbsp;

Многогигабайтные исходные деревья просто не соответствуют им &mdash; Полная продолжительность сборки сайта измеряется в *секундах*, а не часах и минутах.  Система легко поддерживает [`300 MB/s`](features) при обработке ваших источников для полной сборки сайта, но учитывая его <span class="text-white">уникальное, запатентованное управление зависимостью</span> функциональность, к ней практически никогда не нужно прибегать:

&nbsp;

<center>
<span class="text-primary-emphasis"><i class="fa fa-trowel-bricks"></i> <em>Мы строим только то, что вам нужно.</em></span>&trade;
</center>

&nbsp;

Архитектурные сигналы от [Дэвид Уилерс](https://justatheory.com) известный [CMS Бриколаж](https://bricolagecms.org/), это [технология](https://iconoclasts.blog/joe/apache-cms) был впервые изобретен в конце 2010 года [Пол Керна](https://paul.querna.org/articles/2010/10/22/evolution-of-apaches-websites/)Даниэль Шахаф, Дейв Фишер, и [Джо Шефер](https://iconoclasts.blog/joe/) как члены команды инфраструктуры Apache. Фраза "JAMstack" был изобретен много лет спустя (2015), группой, не знавшей о нашем предыдущем искусстве в этом пространстве.  Но [общественная запись](http://web.archive.org/web/20120112045033/http://www.apache.org/dev/cms) кристально ясно, и это новое предложение от SunStar Systems является свидетельством этого оригинального наследия и его истинного происхождения с открытым исходным кодом.

&nbsp;

Когда сообществам проектов программного обеспечения Apache был предоставлен свободный выбор между использованием сайтов, поддерживаемых Confluence, или использованием корней Ориона в качестве CMS Apache, они в подавляющем большинстве выбрали CMS Apache. Мы думаем, что вы тоже, с его значительно улучшенным Орион!

&nbsp;

<h4>Хотите, чтобы он быстро вращался, чтобы увидеть, насколько он быстрый и легкий?</h4>

&nbsp;

Этот веб-сайт самостоятельно размещен на Orion; все эти горяче-розовые квадраты карандашей [<i class='fa fa-file-pen text-danger'></i>](https://cms.sunstarsys.com/redirect?uri=https://www.sunstarsys.com/index) Справа сверху живут.  Не стесняйтесь крутиться и экспериментировать со всем, что вы видите!  Единственное, что вы не можете сделать, это зафиксировать и наблюдать, как ваши изменения строятся и развертываются; это ограничено нашим персоналом по очевидным причинам.

&nbsp;

Наша глобальная сеть Point of Presence (POP) обеспечивает связь с Orion с низкой задержкой &trade; и веб-сайты конечной доставки, которые мы размещаем.  В настоящее время мы находимся на четырех континентах и имеем бикостальное присутствие в США.  Мы стремительно развиваемся в Африке и Восточной Азии!

&nbsp;

<h3>Пришло время перемен в том, как вы управляете и доставляете свой сайт целевой аудитории.</h3>

&nbsp;

Идите в своем собственном темпе, используйте столько сотрудников / предварительный просмотр / правки / фиксации / филиалы, сколько вам нравится, и платите только за то, что вы *фактически используете* в нашей инфраструктуре. Просто возьмите с собой улучшенную платформу CSS / JavaScript, сценарии perl и шаблоны Django, и мы позаботимся об остальной части вашей настройки без дополнительной платы. Мы рекомендуем **Bootstrap 5** для стилей css/js, так как это то, что мы используем внутри; но это полностью зависит от вас.

&nbsp;

Кроме того, все клиенты имеют бесплатные, настраиваемые шаблонами или поддерживаемые JavaScript интерфейсы для наших мощных, проприетарных `PCRE` поисковая система, основанная на лицензированном Apache [`pffxg.sh`](https://github.com/joesuf4/home/blob/wsl/bin/pffxg.sh) сценарий.

&nbsp;

<span class="text-white">Хотите прозрачности? Убедитесь сами:</span>

&nbsp;

Our entire build-system logic for this very website: менее 100 строк кода, в комплекте со сложным, запоминаемым управлением зависимостями, которое автоматически генерирует многоязычные карты сайта, индексы каталогов и многое другое.

&nbsp;

View the source: [наше дерево библиотеки источников](https://vcs.sunstarsys.com/repos/svn/public/cms-sites/www.sunstarsys.com/trunk/lib/)или общественность [<i class="fa fa-github fa-emoji" title="Github"></i> зеркало GitHub](https://github.com/SunStarSys/www/tree/trunk/lib).

&nbsp;

The underlying Static Site Generator: с открытым исходным кодом на GitHub под лицензией Apache 2.0 → @SunStarSys/orion

&nbsp;

Это не маркетинговый спин &mdash; Это проверенное, открытое инженерное наследие, начиная с инноваций F/OSS, впервые появившихся в 2010 году. Готовы испытать вики, которая на самом деле экономит время, деньги и головные боли? [Позвоните нам или напишите нам](/contact) сегодня.

&nbsp;

&nbsp;

<a href="https://iconoclasts.blog/joe/wikis">

```mermaid
mindmap
  root((КМС))
    (Платформы Wiki)
      ((Орион))
      [Слияние]
      [Понятие]
    (Контроль версий)
      [Использование]
        Курация контента
        Управление доступом
        Неизменяемая история
      [Инструменты]
        Гит
        Подвержение
    (Джамстек)
      [CMS]
        Авторы
        Исследователи
        Кураторы
      [Сборки сайтов]
        Разработчики
        Архитекторы
      [Безопасность]
    (ИИ)
     RAG
     Клиника
```

</a>

&nbsp;

&nbsp;

<center>
<div class="card border-primary-emphasis fade" style="max-width:25rem;background-color:#A9BDBD;color:#392806">
<div class="card-header">Начало работы</div>
<div class="card-body">

Самый быстрый способ начать – играть с сборкой по умолчанию @SunStarSys/orion <https://iconoclasts.blog> и погасить источники разметки в `trunk/content`.  ~90% настроек стилей находятся в [`trunk/content/css/local.css`](https://github.com/SunStarSys/www.iconoclasts.blog/blob/trunk/content/css/local.css) &mdash; Приспосабливайтесь к вкусу!

Остальные 10% включают в себя выбор подходящей темы CSS начальной загрузки 5 для замены соответствующих файлов в `content/css/bootstrap.*`; мы рекомендуем <https://bootswatch.com> для идей.

Последним шагом является восстановление навигационных меню верхнего вещества в `templates/main.html.*`. Наш переводчик ИИ будет поддерживать синхронизацию по требованию.

Требуется помощь по настройке `Perl` встроенная система в `lib/` и другие шаблоны Jango в `templates/` чтобы соответствовать вашему сценарию использования?  Мы к вашим услугам!

</div>
</div>
</center>

</div>
</div>

&nbsp;

### Сетка сравнения характеристик

<br />

| Особенность     |   Орион       | Понятие | Слияние |
|:^-----------|:-------------:|:------:|:----------:|
{% for row in grid.content %}| {{ row.Feature|safe }} |  <span class="text-primary-emphasis">{{ row.Orion|safe }}</span> | <span class="text-danger">{{ row.Notion|safe }}</span> |  <span class="text-danger">{{ row.Confluence|safe }}</span> |
{% endfor -%}

<br />

### Сведения

{% for d in deps %}
- [{{d.1.headers.title|safe}}]({{d.0}}) &mdash; {{d.1.content|lede}}
{% endfor %}

<hr>
<br><br><br>

## Несколько репрезентативных снимков экрана

<br>
<h3>IDE View с немецким, французским, ивритом и русским языком (UTF-8).</h3>
<center><img src="../images/ide-fa.png" style="width:800px"></center>
<br><br><br>
<h3>Представление редактора IDE.</h3>
<center><img src="../images/ide-editor.png" style="width:800px"></center>
<br><br><br>
<h3>Представление редактора IDE (на испанском языке).</h3>
<center><img src="../images/ide-es.png" style="width:800px"></center>
<br><br><br>
<h3>Полная сборка сайта IDE.</h3>
<center><img src="../images/ide-build.png" style="width:800px"></center>
<br><br><br>
<h3>Типичная сборка сайта IDE.</h3>
<center><img src="../images/ide-file-build.png" style="width:800px"></center>
<br/><br><br>
<h3><a href="https://cms.sunstarsys.com/redirect?uri=https://www.sunstarsys.com/;action=search;regex=mailto:">Поиск среды IDE</a> <small>(эти ссылки в <span style="color:#e83e8c">розовый</span> будет перетащить вас прямо на экран редактора, с курсором, размещенным точно в соответствии с соответствующим текстом)</small>.</h3>
<center><img src="../images/ide-search.png" style="width:800px"></center>
</div>

<style type="text/css">
/*-------------------------------------------
	Animations
-------------------------------------------*/
@-webkit-keyframes FADEY {
  0%   { opacity: 0; }
  100% { opacity: 1; }
}

button h4 {color: gray;}

.theme-showcase {
	-webkit-animation-name: FADEY;
	-webkit-animation-duration: 2s;
	-webkit-animation-timing-function: ease-in-out;
	-webkit-animation-iteration-count: 1;
}
</style>

<!-- $Date$ $Author$ $Revision$ -->
