---
acl: '@staff=rw, *=r'
categories: ~
dependencies: '*.md.ru api/index.md.ru'
keywords: wiki,jamstack,блог,безопасно,безопасно
status: проверено=48093
title: SunStar Орион систем
---

<div class="row">
<div class="col-lg-5">
<p>
	<span class="text-primary-emphasis"><img style="width:100px" src="../images/sunstar-orion-symbol-linear.png"><!-- Derived work from Dennis Moskowitz's original CC BySA v4.0 -->&nbsp;<em>Платформа Jamstack Wiki.</em></span>&trade;
</p>
<br>
<span class="text-white">SunStar Орион систем</span> &nbsp; является

&nbsp;

<p>
<ul class="list-group">
  <li class="list-group-item list-group-item-primary d-flex justify-content-between align-items-center">

[**невзломный**](security#separation-of-concerns-and-engineering-tradeoffs10)

:fa-lock:

</li>
  <li class="list-group-item list-group-item-secondary d-flex justify-content-between align-items-center">

[**неразрывной**](https://iconoclasts.blog/joe/apache-cms#:~:text=7%20years)

:fa-train:

</li>
  <li class="list-group-item list-group-item-success d-flex justify-content-between align-items-center">

**мобильный**

:fa-mobile:

</li>
  <li class="list-group-item list-group-item-info d-flex justify-content-between align-items-center">

[**пиковая производительность**](features)

:fa-rocket:

</li>
  <li class="list-group-item list-group-item-warning d-flex justify-content-between align-items-center">

**федеративный**

:fa-hexagon-nodes-bolt:

</li>
</ul>
</p>

&nbsp;

{# lede #}<span class="text-white">Корпоративная платформа Jamstack Wiki</span>&nbsp; для <b>создания, управления и доставки</b> статические веб-страницы с использованием технологии Jamstack для динамических функций в них{# lede #}. Для получения информации о ценах см. наш [Планы Ориона](plans).

&nbsp;

<div class="border-top" style="padding-top: 20px">

# <span class="text-warning-emphasis">Для руководителей :fa-briefcase:</span><br>&nbsp;

&nbsp;

# Вот окупаемость инвестиций, которая на самом деле обеспечивает: безопасное, высокопроизводительное управление знаниями за долю затрат :fa-chart-line:

</div>

&nbsp;

<span class="text-white">Проверенная технология Jamstack, которая снижает риски взлома, легко интегрирует реальные данные, математику и ИИ и позволяет экономично масштабировать &mdash; 7 способов, которыми Orion превосходит устаревшие инструменты.</span>

&nbsp;

То, что действительно отличает Orion, не просто еще одна вики-платформа &mdash; Это наша собственная технология Orion, проверенный в бою и запатентованный подход, который обеспечивает элегантный пользовательский опыт с непревзойденной безопасностью, надежностью и эффективностью.

&nbsp;

В отличие от продуктов, которые используют ваши конкуренты, Orion – это платформа, предназначенная для получения превосходной, обслуживаемой, конфиденциальной, но легко находимой корпоративной документации с самой богатой, но наиболее понятной, управляемой сетью ссылок / зависимостей на рынке. **Это превращает коллективный опыт вашей организации из обязательства, которое утекает в ваше самое надежное конкурентное преимущество. **

&nbsp;

<center>

<div class="card border-primary-emphasis fade" style="max-width:25rem;background-color:#A9BDBD;color:#392806">
<div class="card-header">Более безопасный и лучший продукт для <span class="text-white">Меньше денег</span>&nbsp;<i class="fa fa-chart-line"></i>

</div>
<div class="card-body" style="text-align:left">

&nbsp;&nbsp;<a id="fn-1" href="#1">1</a>. Существенное снижение риска безопасности :fa-lock:

&nbsp;&nbsp;<a id="fn-2" href="#2">2</a>. Реальная математика / интеграция данных с поиском и преобразованием ИИ, а также ядро обработки данных и пакет векторной графики :fa-infinity:

&nbsp;&nbsp;<a id="fn-3" href="#3">3</a>. Поддержка искусственного интеллекта :fa-robot:

&nbsp;&nbsp;<a id="fn-4" href="#4">4</a>. Инструментарий обработки содержимого в наборе :fa-map-location-dot:

&nbsp;&nbsp;<a id="fn-5" href="#5">5</a>. [<span class="text-white">Экономьте $100K / год</span>](https://www.atlassian.com/software/confluence/pricing) со [Корпоративное лицензирование Orion $0 за место / на веб-сайте](plans) :fa-scale-balanced:

&nbsp;&nbsp;<a id="fn-6" href="#6">6</a>. [<span class="text-white">Экономия 50% в год</span>](https://www.atlassian.com/software/confluence/pricing) со [Бизнес-план Ориона](plans) над совместимым функцией Confluence Premium :fa-money-check-dollar:

&nbsp;&nbsp;<a id="fn-7" href="#7">7</a>. Доступные и амортизируемые затраты на переключение от слияния :fa-arrow-right-arrow-left:

</div>
</div>
</center>

&nbsp;

<div class="accordion" id="how-so-container" style="background-color: transparent !important; color: black">
<div class="accordion-item" style="background-color: transparent !important; padding-bottom: 0px; border: none">
<div class="accordion-header" id="how-so-heading">
<button class="accordion-button collapsed" data-bs-toggle="collapse" data-bs-target="#how-so-target" aria-expanded="false" aria-controls="how-so-target">

## Показать сведения о ROI :fa-chart-line:

</button>
</div>

<div id="how-so-target" class="accordion-collapse collapse" aria-labelledby="how-so-heading" data-bs-parent="#how-so-container" style="background-color: transparent !important; border: none; color: black">

&nbsp;

[^1]. :fa-lock: Прием Ориона [немедленно снижает риск](security#separation-of-concerns-and-engineering-tradeoffs10) о серьезном инциденте с безопасностью; и спокойствие поставило вопросы больше вашему совету директоров, чем [дорогой полис страхования вымогателей](https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/) Вам никогда не нужно предъявлять претензии.

&nbsp;

[^2]. :fa-infinity: Отложить [преимущества безопасности](https://www.iconoclasts.blog/joe/wishful-thinking) и [ужесточение наказания](https://www.hipaajournal.com/what-are-the-penalties-for-hipaa-violations-7096/) для [нарушения конфиденциальности данных HIPAA](https://cybersecuritynews.com/how-the-atlassian-confluence-breach-rewrites-data-center-security-rules/)фундаментальный недостаток вики-подобных продуктов, кроме Orion, заключается в том, что они не обеспечивают **связную интеграцию / интерфейсы для включения и периодического обслуживания форматов файлов данных, созданных извне**. Тем не менее, сосредоточив внимание на нескольких стандартных форматах текста / исходного документа / данных, даже на самых сложных математических таблицах, графиках, диаграммах, картах и архитектурных диаграммах, которые **доступны для поиска и могут быть переведены с помощью ИИ** на любом из поддерживаемых естественных языков Ориона.

&nbsp;

Orion дополняет свое изображение интеграции данных с ядром базы данных векторов столбцов `PDL` и пакет векторной графики `Asymptote` для ваших интерактивных нужд.

&nbsp;

[^3]. :fa-robot: `MCP` Это ripoff. `RAG` еще хуже. Что вы хотите, это **Двунаправленная синхронизация управления версиями с `git`.** Подключение локального решения Agentic AI вашей компании к рабочему процессу вики вашей команды не становится безопаснее, проще, мощнее или дешевле, чем с Orion.

&nbsp;

[^4]. :fa-map-location-dot: **инструмент для курации контента** является важной особенностью Orion, а не возможностью допродаж. Наша база данных по вики-фактам является первой в отрасли &mdash; удобный для таких вещей, как управление согласованным брендингом имени или метаданные артефактов связанного программного обеспечения по всему веб-сайту с 1-строчным редактированием [Файл YAML](https://github.com/SunStarSys/www.iconoclasts.blog/blob/trunk/lib/facts.yml).

&nbsp;

Вместо неизбежного, энтропического вращения ссылок, врожденных к другим вики-продуктам, вы получаете **внутреннюю/внешнюю проверку ссылок** во время модификации страницы во время всеобъемлющего, `MIME`-тип основанный, пре-комит пропуск линтинга у Ориона `CMS` редактор. Мы также предоставляем каждому клиенту инфраструктуру отчетности для **перехвата устаревших внутренних/внешних ссылок по запросу**, даже если соответствующие страницы не были изменены в течение нескольких месяцев.

&nbsp;

Схемы так же легко синхронизировать с развивающимися изменениями в прозе разметки, потому что с интеграцией русалки Ориона **источники диаграмм встроены в прозу страницы**.

&nbsp;

Безболезненный рекурсивный поиск / замена для ремонта накопленного крыла встроен в `PCRE` поисковая система в `CMS`.

&nbsp;

<span class="text-white">Измеримый рост окупаемости инвестиций в вашей организации – это последовательный, непрерывный цветущий эффект от использования совокупных способностей садоводства и ухода, уникальных для нашей вики-платформы.</span>

&nbsp;

Вы когда-нибудь видели вики-систему, которая может надежно интегрировать отфильтрованный контент / данные в независимые исходные файлы?  [**Orion может**](https://www.iconoclasts.blog/joe/)с полной поддержкой [**циклические взаимозависимости**](https://www.iconoclasts.blog/joe/dependencies) и контроль авторизации для каждого исходного файла.  Нет просто способа случайно (или злонамеренно) отмывать контент, контролируемый доступом, через его функциональность интеграции контента, и нет способа, чтобы контент / данные в таких файлах были изменены без этих изменений, связанных с вызовом параллельных сборок их зависимых файлов.

&nbsp;

[^5]. :fa-scale-balanced: Более того, Orion масштабируется вместе с вами по мере роста, особенно на уровне предприятия. The <span class="text-white">**$0 за лицензию на место и неограниченное количество веб-сайтов**</span> открывает новые возможности для контролируемого обмена знаниями и сотрудничества между командами, партнерами, веб-сайтами и даже всей планетой с помощью нашей федеративной платформы! Мы знаем, что для большинства клиентов только крошечная часть этих лицензий будет использоваться для редактирования страниц, но они могут использовать неограниченное количество "связан" учетные записи только для чтения в своих вики для обмена защищенной информацией через Интернет. Учетные записи, которым не требуется доступ к Orion `CMS` надлежащий &mdash; экономичная функция, уникальная для Orion, как единственная поддерживаемая корпорацией **Enterprise Jamstack Wiki**.

&nbsp;

По мере того как корпоративный статус вашего персонала со временем меняется, Orion упрощает администраторам вики работу с соответствующими повторными авторизациями вики. Массовый поиск и замена при каждом явном `ACL` настройка на сайте, привязанном к учетной записи бывшего сотрудника, так же тривиально автоматизирована, как адаптация нового сотрудника или обновление существующего, путем их переноса в соответствующие группы авторизации контроля версий, которые разработала ваша команда[^владение].

&nbsp;

[^6]. :fa-money-check-dollar: с другими рыночными решениями, [без премиального плана вы сами](https://www.atlassian.com/software/confluence/resources/guides/premium-admin/manage-content-at-scale#what-is-content-manager). Ежемесячная цена подписки Orion для a [Бизнес-план составляет ~$2500 / месяц на 300 мест](plans); [Confluence Premium находится к северу от $3000+ за те же 300 мест](https://www.atlassian.com/software/confluence/pricing).

По мере того, как количество мест перемещается в любом направлении с 300, ваши **сбережения увеличиваются**. &gt;500 ставит вас на уровень предприятия[^5]; и на **50 мест ваш ежемесячный счет составляет 1/5 то, что вы платите Atlassian сейчас**.

&nbsp;

[^7]. :fa-arrow-right-arrow-left: Стоимость перехода от слияния к адаптации может составлять всего 100 долларов для малого и среднего бизнеса и амортизироваться в течение первых трех лет обслуживания для клиентов, нуждающихся в более практическом подходе. Общий процесс состоит в четыре раза:

1. согласовать желаемую топологию карты сайта от отдельных пространств слияния до вики-файлов и папок Ориона,

2. проектирование и внедрение `Django` файлы шаблонов и `Perl` построение логики для размещения выше топологии, брендинга и желаемого внешнего вида построенного `HTML` до начала работы,

3. настроить `xsltproc` скрипт для выполнения преобразования [`XML` сброс всего пространства слияния](https://confluence.atlassian.com/doc/export-content-to-word-pdf-html-and-xml-139475.html) в нужный исходный план дерева, и

4. построить вики-сайт Ориона и вернуться к вышеуказанным шагам для настройки и повторной настройки, пока клиент не будет удовлетворен и готов к окончательному подписанию контракта.

Может показаться, что вышеприведенный шаг 2 предполагает, что могут начисляться значительные затраты, однако основная часть этого шага поддается автоматизации ИИ. Клиенты также могут сохранять свои подписки Confluence до тех пор, пока им это нравится, не вступая в конфликты со своими новыми вики Orion, просто чтобы снизить связанные с этим риски.

&nbsp;

Наконец, мы адаптируем каждую установку к вашим конкретным требованиям и **всегда доступны для консультации и профессионального коучинга**, чтобы обеспечить максимальную отдачу от ваших инвестиций в наши продукты и услуги. **У вашей команды есть партнер в нас** с точки зрения обеспечения того, чтобы вы видели ожидаемый прирост производительности и удовлетворенность клиентов, связанную с Orion &mdash; предназначен для надежного, проверенного, совместного создания и обработки знаний; и простой, всеобъемлющий, точный поиск информации.

&nbsp;

### Сноски

&nbsp;

[^владение]. Фактически, в системе **не существует формального понятия владения страницами**. Управление версиями Orion просто отслеживает разрешенные пользователем наборы изменений персонала во время внесенных пользователем изменений, предоставляя более коллегиальную корпоративную культуру в отношении комбинированного рабочего продукта вики, чем в любой другой аналогичной системе. Тем не менее, безусловно, можно облегчить и поддержать "владение" двигаться вперед с явным `ACL` назначения заголовков на соответствующих страницах и/или пользовательские `view` который включает "авторство" как `Author` header или аналогичный wiki page-build на вашем сайте.

&nbsp;

<div class="border-top">&nbsp;</div>

</div>
</div>
</div>

&nbsp;

## Оставьте истощающие болевые точки прошлого позади...

&nbsp;

Для многих компаний Jira является удивительно эффективным инструментом для управления проектами. Однако со временем вы начинаете понимать, что [Конфлюенс просто помечается для поездки](https://projectmanagers.net/top-10-cons-disadvantages-of-using-confluence/)...

Если это резонирует, вы устали бросать больше хороших денег на плохие инвестиции?

&nbsp;

Не нужно тратить драгоценный капитал на [трудно обеспечить](https://matthiasfrank.de/en/notion-security/), [ухудшение производительности](https://www.reddit.com/r/Notion/comments/1rdals6/is_notion_getting_slower_or_is_it_just_me/), a [на порядок дороже для бизнеса](https://www.notion.com/pricing), [ненадежный](https://isdown.app/status/notion) Сервис SaaS, который не может выполнить свои обещания по повышению производительности? Другими словами, что-то вроде понятия?

Предпочитайте *grokability* такой системы, как Orion &mdash; организованы вокруг *документов с прикрепленными данными*; вместо специфических *баз данных Понятия с прикрепленными документами*?

&nbsp;

Хотите более консервативный / суверенный подход, чем просто разоблачение всех ваших корпоративных секретов недобросовестным поставщикам ИИ :fa-openai: и их злополучные пограничные модели?

&nbsp;

## Орион создан для лидеров, которые отказываются селиться

&nbsp;

<div class="fade">

- :fa-school-flag: **Университетские лидеры** &mdash; Устраните плагиат в кампусе и обеспечьте безопасную совместную работу с открытым доступом с помощью совместного использования документов, курирования и онлайн-публикации с контролем версий. Превратите управление академическими знаниями в современное, доступное для аудита, [Открытая наука](https://www.iconoclasts.blog/joe/triple-products) Платформа.

</div>

&nbsp;

<div class="fade">
<center>
<img src="index.page/hipaa" style="width:25%">
</center>

- :fa-building-columns: **Здравоохранение, Правительство &amp; лица, принимающие решения в области ИТ** &mdash; Соответствие требованиям инфраструктуры FedRAMP, NIST 800-207 с нулевым доверием и HIPAA. Наслаждайтесь детализированными элементами управления доступом в репозитории управления версиями &mdash; все с безопасностью, совместимой с FIPS 140-3, и возможностью установки внутри вашего VPN.

</div>

&nbsp;

<div class="fade">

- :fa-cart-arrow-down: **Руководители по маркетингу** &mdash; Используйте быструю, глобальную, инновационную корпоративную платформу для корпоративных ресурсов веб-сайтов. Использование Orion в качестве мощной автономной CMS &mdash; безопасная, производительная и полностью отделенная от внешнего интерфейса доставка.

</div>

&nbsp;

<div class="fade">

- :fa-computer: **Технологические компании &amp; веб-агентства** &mdash; Замените небезопасные коммерческие вики, приручите горы документации по продуктам, клиентские сайты и даже двоичные загрузки. Отбирайте все с уверенностью, скоростью и историей версий.

</div>

&nbsp;

<div class="fade">

- :fa-compass-drafting: **Архитекторы высокой доступности &amp; Основные инженеры** &mdash; Избегайте одиночных точек отказа, встроенных в стеки LAMP на основе SQL. Реализуйте настоящую масштабируемость Jamstack: параллельные сборки, инкрементные обновления, глобальный охват POP и пиковая производительность, измеряемая в миллисекундах.

</div>

&nbsp;

<div class="fade">

- :fa-business-time: **Любой бизнес устал от экономики вики** &mdash; Откажитесь от дорогостоящих подписок на SaaS, хрупких бесплатных инструментов, которые истощают время персонала, и устаревших систем, которые замедляют работу вашей команды. Orion дает вам мощность предприятия за долю от общей стоимости владения (часто ниже 25 000 долларов США в год для полного использования на предприятии).

</div>

&nbsp;

Отсутствие привязки к поставщику &mdash; И мы докажем это*. Ваш контент живет в чистых Markdown и стандартных рабочих процессах управления версиями. Нет фирменных форматов. Никаких миграционных кошмаров.

&nbsp;

&nbsp;

&nbsp;

<center>

<span class="btn bg-secondary">[<span class="text-white">Свяжитесь с нами для корпоративных расценок и бесплатной демонстрации](../contact)</span>

</center>
</div>
<div class="col-lg-6 border-start">
<a href="features"><img id="ad1" style="width:100%;margin-bottom:64px;margin-top:3px;" src="index.page/ad1"></a>

&nbsp;

<center>

[Перейти к сетке сравнения функций](#h1-feature-comparison-grid)

</center>

&nbsp;

<div class="border-top" style="padding-top: 20px">

# <span class="text-warning-emphasis">Для молодых&nbsp;Преподаватели&nbsp;:fa-orcid: / Полный&nbsp;Стек&nbsp;Разработчики&nbsp;:fa-stack-overflow: / Общедоступный&nbsp;Блогеры&nbsp;:fa-blog:&nbsp;</span>

&nbsp;

# Хотите молнию-быстро :fa-cloud-bolt:, безопасный личный сайт :fa-lock: Это простое управление &mdash; Невероятно мощный?
</div>

&nbsp;

Нужно больше лошадиных сил, чем [один трюк пони, как Hugo](https://www.iconoclasts.blog/joe/ssg) консервный нож :fa-horse:?

&nbsp;

Если вы устали от лицензирования на место и выбора на ЦП, взвешивая вас с другими поставщиками хостинга Jamstack, когда вам просто нужно исправить опечатку, [связаться с нами](/contact). Если вы отвечаете за курирование контента и ищете настраиваемую базу данных фактов для управления вашими внешними ссылками, или если вы укротитель львов с регулярным выражением для Десятилетиями накопленного устаревшего HTML-контента, или просто кого-то, недовольного другими вариантами на рынке и тем, как они функционируют в масштабе, у нас есть что-то действительно особенное, чтобы предложить вам.

&nbsp;

Никогда не иметь дело непосредственно с системой контроля версий или даже статическим генератором сайта, на вашем персональном компьютере зависит от вас. Онлайн-редактор CMS/IDE разработан и готов для **рабочего процесса только для браузера** в любое время.  В крайнем случае, даже мобильный (браузерный) интерфейс сделает это *мгновенно*.

&nbsp;

<div id="lightning">

![Молния](index.page/lightning)

</div>

<style type="text/css">

div#lightning img {width:100%}

</style>

&nbsp;

Многогигабайтные исходные деревья просто не соответствуют им &mdash; Полная продолжительность сборки сайта измеряется в *секундах*, а не часах и минутах.  Система легко поддерживает [`300 MB/s`](features) при обработке ваших источников для полной сборки сайта, но учитывая его <span class="text-white">уникальное, запатентованное управление зависимостью</span> функциональность, к ней практически никогда не нужно прибегать:

&nbsp;

<center>
<span class="text-primary-emphasis"><i class="fa fa-trowel-bricks"></i> <em>Мы строим только то, что вам нужно.</em></span>&trade;
</center>

&nbsp;

Когда сообществам проектов программного обеспечения Apache был предоставлен свободный выбор между использованием сайтов, поддерживаемых Confluence, или использованием корней Orion в качестве [CMS Apache](https://www.iconoclasts.blog/joe/apache-cms)В основном они выбрали CMS Apache. Мы думаем, что вы тоже, с его значительно улучшенным Орион!

&nbsp;

## Безопасно по умолчанию, с управлением версиями и быстрее, чем у других статических генераторов сайтов.  Мгновенная публикация или изменения этапа &mdash; Попробуйте быстрое демо и посмотрите, почему это легко.

&nbsp;

Этот веб-сайт самостоятельно размещен на Orion; все эти горяче-розовые квадраты карандашей [<i class='fa fa-file-pen text-danger'></i>](https://cms.sunstarsys.com/redirect?uri=https://www.sunstarsys.com/index) Справа сверху живут. Не стесняйтесь крутиться и экспериментировать со всем, что вы видите!  Единственное, что вы не можете сделать, это зафиксировать и наблюдать, как ваши изменения строятся и развертываются; это ограничено нашим персоналом по очевидным причинам.

&nbsp;

Наша глобальная сеть Point of Presence (POP) обеспечивает связь с Orion с низкой задержкой &trade; и веб-сайты конечной доставки, которые мы размещаем.  В настоящее время мы находимся на четырех континентах и имеем бикостальное присутствие в США.  Мы стремительно развиваемся в Африке и Восточной Азии!

&nbsp;

### Пришло время перемен в том, как вы управляете и доставляете свой сайт целевой аудитории.

&nbsp;

Идите в своем собственном темпе, используйте столько сотрудников / предварительный просмотр / правки / фиксации / филиалы, сколько вам нравится, и платите только за то, что вы *фактически используете* в нашей инфраструктуре. Просто возьмите с собой улучшенную платформу CSS / JavaScript, сценарии perl и шаблоны Django, и мы позаботимся об остальной части вашей настройки без дополнительной платы. Мы рекомендуем **Bootstrap 5** для стилей css/js, так как это то, что мы используем внутри; но это полностью зависит от вас.

&nbsp;

Кроме того, все клиенты имеют бесплатные, настраиваемые шаблонами или поддерживаемые JavaScript интерфейсы для наших мощных, проприетарных `PCRE` поисковая система, основанная на лицензированном Apache [`pffxg.sh`](https://github.com/joesuf4/home/blob/wsl/bin/pffxg.sh) сценарий.

&nbsp;

<span class="text-white">Хотите прозрачности? Убедитесь сами:</span>

&nbsp;

Our entire build-system logic for this very website: менее 100 строк кода, в комплекте со сложным, запоминаемым управлением зависимостями, которое автоматически генерирует многоязычные карты сайта, индексы каталогов и многое другое.

&nbsp;

View the source: [наше дерево библиотеки источников](https://vcs.sunstarsys.com/repos/svn/public/cms-sites/www.sunstarsys.com/trunk/lib/)или общественность [<i class="fa fa-github fa-emoji" title="Github"></i> зеркало GitHub](https://github.com/SunStarSys/www/tree/trunk/lib).

&nbsp;

The underlying Static Site Generator: с открытым исходным кодом на GitHub под лицензией Apache 2.0 → @SunStarSys/orion

&nbsp;

Это не маркетинговый спин &mdash; Это проверенное, открытое инженерное наследие, начиная с инноваций F/OSS, впервые появившихся в 2010 году. Готовы испытать вики, которая на самом деле экономит время, деньги и головные боли? [Позвоните нам или напишите нам](/contact) сегодня.

&nbsp;

&nbsp;

<center>
<div class="card border-primary-emphasis fade" style="max-width:25rem;background-color:#A9BDBD;color:#392806">
<div class="card-header">Начало работы</div>
<div class="card-body">

Самый быстрый способ начать – играть с сборкой по умолчанию @SunStarSys/orion <https://iconoclasts.blog> и погасить источники разметки в `trunk/content`.  ~90% настроек стилей находятся в [`trunk/content/css/local.css`](https://github.com/SunStarSys/www.iconoclasts.blog/blob/trunk/content/css/local.css) &mdash; Приспосабливайтесь к вкусу!

Остальные 10% включают в себя выбор подходящей темы CSS начальной загрузки 5 для замены соответствующих файлов в `content/css/bootstrap.*`; мы рекомендуем <https://bootswatch.com> для идей.

Последним шагом является восстановление навигационных меню верхнего вещества в `templates/main.html.*`. Наш переводчик ИИ будет поддерживать синхронизацию по требованию.

Требуется помощь по настройке `Perl` встроенная система в `lib/` и другие шаблоны Jango в `templates/` чтобы соответствовать вашему сценарию использования?  Мы к вашим услугам!

</div>
</div>
</center>

</div>
</div>

&nbsp;

# Сетка сравнения характеристик

<br />

| Особенность     |   Орион       | Понятие | Слияние |
|:^-----------|:-------------:|:------:|:----------:|
{% for row in grid.content %}| {{ row.Feature|safe }} |  <span class="text-primary-emphasis">{{ row.Orion|safe }}</span> | <span class="text-danger">{{ row.Notion|safe }}</span> |  <span class="text-danger">{{ row.Confluence|safe }}</span> |
{% endfor -%}

<br />

# Сведения

{% for d in deps %}
- [{{d.1.headers.title|safe}}]({{d.0}}) &mdash; {{d.1.content|lede}}
{% endfor %}

&nbsp;

<style type="text/css">
/*-------------------------------------------
	Animations
-------------------------------------------*/
@-webkit-keyframes FADEY {
  0%   { opacity: 0; }
  100% { opacity: 1; }
}

button h4 {color: gray;}

.theme-showcase {
	-webkit-animation-name: FADEY;
	-webkit-animation-duration: 2s;
	-webkit-animation-timing-function: ease-in-out;
	-webkit-animation-iteration-count: 1;
}
</style>

<!-- $Date$ $Author$ $Revision$ -->
