---
acl: '@staff=rw, *=r'
categories: ~
dependencies: '*.md.ru api/index.md.ru'
keywords: wiki,jamstack,блог,безопасно,безопасно
status: черновик
title: SunStar Орион систем
---

[TOC]#sidebar

<div class="row">
<div class="col-lg-5">
<p>
	<span class="text-primary-emphasis"><img style="width:100px" src="../images/sunstar-orion-symbol-linear.png"><!-- Derived work from Dennis Moskowitz's original CC BySA v4.0 -->&amp;nbsp<em>Платформа Jamstack Wiki.</em></span>&trade;
</p>
<br>
<span class="text-white">SunStar Орион систем</span> &nbsp; является

&nbsp;

<p>
<ul class="list-group">
  <li class="list-group-item list-group-item-primary d-flex justify-content-between align-items-center">

[**невзломный**](security#separation-of-concerns-and-engineering-tradeoffs10)

:fa-lock:

</li>
  <li class="list-group-item list-group-item-secondary d-flex justify-content-between align-items-center">

[**неразрывной**](https://iconoclasts.blog/joe/apache-cms#:~:text=7%20years)

:fa-train:

</li>
  <li class="list-group-item list-group-item-success d-flex justify-content-between align-items-center">

**мобильный**

:fa-mobile:

</li>
  <li class="list-group-item list-group-item-info d-flex justify-content-between align-items-center">

[**пиковая производительность**](features)

:fa-rocket:

</li>
  <li class="list-group-item list-group-item-warning d-flex justify-content-between align-items-center">

**федеративный**

:fa-hexagon-nodes-bolt:

</li>
</ul>
</p>

&nbsp;

{# lede #}<span class="text-white">Корпоративная платформа Jamstack Wiki</span>&nbsp; для <b>создания, управления и доставки</b> статические веб-страницы с использованием технологии Jamstack для динамических функций в них{# lede #}. Для получения информации о ценах см. наш [Планы Ориона](plans).

&nbsp;

### Вот окупаемость инвестиций, ответственный за принятие решений :fa-chart-line:...

<span class="text-white">Почему выбирают Орион? Платформа Jamstack Wiki, которая превосходит &mdash; и затраты намного меньше</span>

&nbsp;

То, что действительно отличает Orion, не просто еще одна вики-платформа &mdash; Это наша собственная технология Orion, проверенный в бою и запатентованный подход, который обеспечивает элегантный пользовательский опыт с непревзойденной безопасностью, надежностью и эффективностью.

&nbsp;

Это позволяет нам выполнять сверхнизкие операционные расходы, предлагая превосходные средства контроля редакций, безопасность корпоративного уровня и новаторские функции, которые не могут соответствовать устаревшим вики-ресурсам. Мы передаем эту огромную экономию непосредственно вам. Ожидайте только скромные, прозрачные сборы за точные облачные ресурсы, которые вы используете &mdash; нет раздутых ценовых уровней или скрытых сборов.

&nbsp;

Ничто не принесет лучшей окупаемости инвестиций, чем Orion в пространстве системы управления знаниями.  Мы адаптируем каждую установку к вашим конкретным требованиям и всегда доступны для консультации и профессионального коучинга, чтобы обеспечить максимальную отдачу от ваших инвестиций в наши продукты и услуги.

&nbsp;

**У вашей команды есть партнер** с точки зрения обеспечения того, чтобы вы видели повышение производительности, связанное с Orion &mdash; предназначен для надежного, проверенного, совместного создания знаний; и простой, всеобъемлющий, точный поиск информации.

&nbsp;

<span class="text-white">Оставьте финансовые истощающие болевые точки прошлого позади...</span>

Для многих компаний Jira является удивительно эффективным инструментом для управления проектами. Однако со временем вы начинаете понимать, что [Конфлюенс просто помечается для поездки](https://projectmanagers.net/top-10-cons-disadvantages-of-using-confluence/)...

Если это резонирует, вы устали бросать больше хороших денег на плохие инвестиции из-за разрозненного, денормализованного, недостижимого, устаревшего, завязанного ссылками конфлюенса с паршивым текстовым редактором и даже более крутой поисковой системой?

&nbsp;

Не нужно тратить драгоценный капитал на [ухудшение производительности](https://www.reddit.com/r/Notion/comments/1rdals6/is_notion_getting_slower_or_is_it_just_me/) дорогой, раздутый, [ненадежный](https://isdown.app/status/notion), универсальный сервис OCD-lover SaaS, который не может выполнить свои обещания по повышению производительности? Другими словами, что-то вроде понятия?

Предпочитайте *grokability* такой системы, как Orion &mdash; организовано вокруг *документов с прикрепленными данными*; вместо *баз данных Содержания с прикрепленными документами*?

&nbsp;

Хотите более консервативный подход, чем просто разоблачение всех ваших корпоративных секретов недобросовестным поставщикам ИИ и их недобросовестным пограничным моделям?

&nbsp;

<span class="text-white">Орион построен для лидеров, которые отказываются поселиться:</span>

<div class="fade">

- :fa-school-flag: **Университетские лидеры** &mdash; Устраните плагиат в кампусе и обеспечьте безопасную совместную работу с открытым доступом с помощью совместного использования документов, курирования и онлайн-публикации с контролем версий. Превратите управление академическими знаниями в современное, доступное для аудита, [Открытая наука](https://www.iconoclasts.blog/joe/triple-products) Платформа.

</div>

&nbsp;

<div class="fade">
<center>
<img src="index.page/hipaa" style="width:25%">
</center>

- :fa-building-columns: **Здравоохранение, Правительство &amp; лица, принимающие решения в области ИТ** &mdash; Соответствие требованиям инфраструктуры FedRAMP, NIST 800-207 с нулевым доверием и HIPAA. Наслаждайтесь детализированными элементами управления доступом в репозитории управления версиями &mdash; все с безопасностью, совместимой с FIPS 140-3, и возможностью установки внутри вашего VPN.

</div>

&nbsp;

<div class="fade">

- :fa-cart-arrow-down: **Руководители по маркетингу** &mdash; Используйте быструю, глобальную, инновационную корпоративную платформу для корпоративных ресурсов веб-сайтов. Использование Orion в качестве мощной автономной CMS &mdash; безопасная, производительная и полностью отделенная от внешнего интерфейса доставка.

</div>

&nbsp;

<div class="fade">

- :fa-computer: **Технологические компании &amp; веб-агентства** &mdash; Замените небезопасные коммерческие вики, приручите горы документации по продуктам, клиентские сайты и даже двоичные загрузки. Отбирайте все с уверенностью, скоростью и историей версий.

</div>

&nbsp;

<div class="fade">

- :fa-compass-drafting: **Архитекторы высокой доступности &amp; Основные инженеры** &mdash; Избегайте одиночных точек отказа, встроенных в стеки LAMP на основе SQL. Реализуйте настоящую масштабируемость Jamstack: параллельные сборки, инкрементные обновления, глобальный охват POP и пиковая производительность, измеряемая в миллисекундах.

</div>

&nbsp;

<div class="fade">

- :fa-business-time: **Любой бизнес устал от экономики вики** &mdash; Откажитесь от дорогостоящих подписок на SaaS, хрупких бесплатных инструментов, которые истощают время персонала, и устаревших систем, которые замедляют работу вашей команды. Orion дает вам мощность предприятия за долю от общей стоимости владения (часто ниже 25 000 долларов США в год для полного использования на предприятии).

</div>

&nbsp;

Отсутствие привязки к поставщику &mdash; И мы докажем это*. Ваш контент живет в чистых Markdown и стандартных рабочих процессах управления версиями. Нет фирменных форматов. Никаких миграционных кошмаров.

&nbsp;

<span class="text-white">Хотите прозрачности? Убедитесь сами:</span>

Our entire build-system logic for this very website: менее 100 строк кода, в комплекте со сложным, запоминаемым управлением зависимостями, которое автоматически генерирует многоязычные карты сайта, индексы каталогов и многое другое.

View the source: [наше дерево библиотеки источников](https://vcs.sunstarsys.com/repos/svn/public/cms-sites/www.sunstarsys.com/trunk/lib/)или общественность [<i class="fa fa-github fa-emoji" title="Github"></i> зеркало GitHub](https://github.com/SunStarSys/www/tree/trunk/lib).

The underlying Static Site Generator: с открытым исходным кодом на GitHub под лицензией Apache 2.0 → @SunStarSys/orion

Это не маркетинговый спин &mdash; Это проверенное, открытое инженерное наследие, начиная с инноваций F/OSS, впервые появившихся в 2011 году. Готовы испытать вики, которая на самом деле экономит время, деньги и головные боли? [Позвоните нам или напишите нам](/contact) сегодня.

</div>
<div class="col-lg-6 border-start" style="border-color: #A9BDBD">

<a href="https://iconoclasts.blog/joe/wikis">

```mermaid
mindmap
  root((КМС))
    (Платформы Wiki)
      ((Орион))
      [Слияние]
      [Понятие]
    (Контроль версий)
      [Использование]
        Курация контента
        Управление доступом
        Неизменяемая история
      [Инструменты]
        Гит
        Подвержение
    (Джамстек)
      [CMS]
        Авторы
        Исследователи
        Кураторы
      [Сборки сайтов]
        Разработчики
        Архитекторы
      [Безопасность]
    (ИИ)
     RAG
     Клиника
```

</a>

&nbsp;

&nbsp;

&nbsp;

### Вот&nbsp;Почему,&nbsp;Молодые&nbsp;Академический&nbsp;:fa-orcid: / Полный&nbsp;Стек&nbsp;Разработчик&nbsp;:fa-stack-overflow: / Общедоступный&nbsp;Блогер&nbsp;:fa-blog:&nbsp;...

&nbsp;

Хотите сайт, который **безопасен по умолчанию**? Легко обновлять и управлять, скрывая сложность базовой системы управления версиями, но обеспечивая полную мощность, когда она действительно нужна?  Мгновенная публикация, когда это необходимо; плавная поэтапная сборка филиалов и настраиваемые детализированные рекламные акции для вашего производственного сайта, поскольку это соответствует предпочтительному рабочему процессу вашей команды.

&nbsp;

Если вы устали от лицензирования на место и выбора на ЦП, взвешивающих вас всякий раз, когда вам нужно исправить опечатку, [связаться с нами](/contact). Если вы отвечаете за курирование контента и ищете настраиваемую базу данных фактов для управления вашими внешними ссылками, или если вы укротитель львов с регулярным выражением для Десятилетиями накопленного устаревшего HTML-контента, или просто кого-то, недовольного другими вариантами на рынке и тем, как они функционируют в масштабе, у нас есть что-то действительно особенное, чтобы предложить вам.

&nbsp;

Никогда не иметь дело непосредственно с системой контроля версий или даже статическим генератором сайта, на вашем персональном компьютере зависит от вас. Интерактивная среда IDE разработана и готова для **рабочего процесса только для браузера** в любое время.  В крайнем случае, даже мобильный (браузерный) интерфейс сделает это *мгновенно*.

<div id="lightning">

![Молния](index.page/lightning)

</div>

<style type="text/css">

div#lightning img {width:100%}

</style>

&nbsp;

Многогигабайтные исходные деревья просто не соответствуют им &mdash; Полная продолжительность сборки сайта измеряется в *секундах*, а не часах и минутах.  Система легко поддерживает [`300 MB/s`](features) при обработке ваших источников для полной сборки сайта, но учитывая его <span class="text-white">уникальное, запатентованное управление зависимостью</span> функциональность, к ней практически никогда не нужно прибегать:

&nbsp;

<center>
<span class="text-primary-emphasis"><i class="fa fa-trowel-bricks"></i> <em>Мы строим только то, что вам нужно.</em></span>&trade;
</center>

&nbsp;

Архитектурные сигналы от [Дэвид Уилерс](https://justatheory.com) известный [CMS Бриколаж](https://bricolagecms.org/), это [технология](https://iconoclasts.blog/joe/apache-cms) был впервые изобретен в конце 2010 года [Пол Керна](https://paul.querna.org/articles/2010/10/22/evolution-of-apaches-websites/)Даниэль Шахаф, Дейв Фишер, и [Джо Шефер](https://iconoclasts.blog/joe/) как члены команды инфраструктуры Apache. Фраза "JAMstack" был изобретен много лет спустя (2015), группой, не знавшей о нашем предыдущем искусстве в этом пространстве.  Но [общественная запись](http://web.archive.org/web/20120112045033/http://www.apache.org/dev/cms) кристально ясно, и это новое предложение от SunStar Systems является свидетельством этого оригинального наследия и его истинного происхождения с открытым исходным кодом.

&nbsp;

Когда сообществам проектов программного обеспечения Apache был предоставлен свободный выбор между использованием сайтов, поддерживаемых Confluence, или использованием корней Ориона в качестве CMS Apache, они в подавляющем большинстве выбрали CMS Apache. Мы думаем, что вы тоже, с его значительно улучшенным Орион!

&nbsp;

<h4>Хотите, чтобы он быстро вращался, чтобы увидеть, насколько он быстрый и легкий?</h4>

Этот веб-сайт самостоятельно размещен на Orion; все эти горяче-розовые квадраты карандашей [<i class='fa fa-file-pen text-danger'></i>](https://cms.sunstarsys.com/redirect?uri=https://www.sunstarsys.com/index) Справа сверху живут.  Не стесняйтесь крутиться и экспериментировать со всем, что вы видите!  Единственное, что вы не можете сделать, это зафиксировать и наблюдать, как ваши изменения строятся и развертываются; это ограничено нашим персоналом по очевидным причинам.

Наша глобальная сеть Point of Presence (POP) обеспечивает связь с Orion с низкой задержкой &trade; и веб-сайты конечной доставки, которые мы размещаем.  В настоящее время мы находимся на четырех континентах и имеем бикостальное присутствие в США.  Мы стремительно развиваемся в Африке и Восточной Азии!

&nbsp;

<h3>Пришло время перемен в том, как вы управляете и доставляете свой сайт целевой аудитории.</h3>

&nbsp;

Идите в своем собственном темпе, используйте столько сотрудников / предварительный просмотр / правки / фиксации / филиалы, сколько вам нравится, и платите только за то, что вы *фактически используете* в нашей инфраструктуре. Просто возьмите с собой улучшенную платформу CSS / JavaScript, сценарии perl и шаблоны Django, и мы позаботимся об остальной части вашей настройки без дополнительной платы. Мы рекомендуем **Bootstrap 5** для стилей css/js, так как это то, что мы используем внутри; но это полностью зависит от вас.

Кроме того, все клиенты имеют бесплатные, настраиваемые шаблонами или поддерживаемые JavaScript интерфейсы для нашей мощной, проприетарной поисковой системы PCRE.

&nbsp;

<a href="features"><img id="ad1" style="width:100%;margin-bottom:0px" src="index.page/ad1"></a>

&nbsp;

&nbsp;

<center>
<div class="card border-primary-emphasis fade" style="max-width:25rem;background-color:#A9BDBD;color:#392806">
<div class="card-header">Начало работы</div>
<div class="card-body">

Самый быстрый способ начать – играть с сборкой по умолчанию @SunStarSys/orion <https://iconoclasts.blog> и погасить источники разметки в `trunk/content`.  ~90% настроек стилей находятся в [`trunk/content/css/local.css`](https://github.com/SunStarSys/www.iconoclasts.blog/blob/trunk/content/css/local.css) &mdash; Приспосабливайтесь к вкусу!

Остальные 10% включают в себя выбор подходящей темы CSS начальной загрузки 5 для замены соответствующих файлов в `content/css/bootstrap.*`; мы рекомендуем <https://bootswatch.com> для идей.

Последним шагом является восстановление навигационных меню верхнего вещества в `templates/main.html.*`. Наш переводчик ИИ будет поддерживать синхронизацию по требованию.

Требуется помощь по настройке `Perl` встроенная система в `lib/` и другие шаблоны Jango в `templates/` чтобы соответствовать вашему сценарию использования?  Мы к вашим услугам!

</div>
</div>
</center>

</div>
</div>

&nbsp;

### Сетка сравнения характеристик

<br />

| Особенность     |   Орион       | Понятие | Слияние |
|:^-----------|:-------------:|:------:|:----------:|
{% for row in grid.content %}| {{ row.Feature|safe }} |  <span class="text-primary-emphasis">{{ row.Orion|safe }}</span> | <span class="text-danger">{{ row.Notion|safe }}</span> |  <span class="text-danger">{{ row.Confluence|safe }}</span> |
{% endfor -%}

<br />

### Сведения

{% for d in deps %}
- [{{d.1.headers.title|safe}}]({{d.0}}) &mdash; {{d.1.content|lede}}
{% endfor %}

<hr>
<br><br><br>

## Несколько репрезентативных снимков экрана

<br>
<h3>IDE View с немецким, французским, ивритом и русским языком (UTF-8).</h3>
<center><img src="../images/ide-fa.png" style="width:800px"></center>
<br><br><br>
<h3>Представление редактора IDE.</h3>
<center><img src="../images/ide-editor.png" style="width:800px"></center>
<br><br><br>
<h3>Представление редактора IDE (на испанском языке).</h3>
<center><img src="../images/ide-es.png" style="width:800px"></center>
<br><br><br>
<h3>Полная сборка сайта IDE.</h3>
<center><img src="../images/ide-build.png" style="width:800px"></center>
<br><br><br>
<h3>Типичная сборка сайта IDE.</h3>
<center><img src="../images/ide-file-build.png" style="width:800px"></center>
<br/><br><br>
<h3><a href="https://cms.sunstarsys.com/redirect?uri=https://www.sunstarsys.com/;action=search;regex=mailto:">Поиск среды IDE</a> <small>(эти ссылки в <span style="color:#e83e8c">розовый</span> будет перетащить вас прямо на экран редактора, с курсором, размещенным точно в соответствии с соответствующим текстом)</small>.</h3>
<center><img src="../images/ide-search.png" style="width:800px"></center>
</div>

<style type="text/css">
/*-------------------------------------------
	Animations
-------------------------------------------*/
@-webkit-keyframes FADEY {
  0%   { opacity: 0; }
  100% { opacity: 1; }
}

.theme-showcase {
	-webkit-animation-name: FADEY;
	-webkit-animation-duration: 2s;
	-webkit-animation-timing-function: ease-in-out;
	-webkit-animation-iteration-count: 1;
}
</style>

<!-- $Date$ $Author$ $Revision$ -->
