---
categories: ~
dependencies: '*.md.ru api/index.md.ru'
keywords: Jamstack,wiki,kms,cms
status: опубликовано
title: Планы Ориона
---

<div class="row fade">
  <div class="col-lg-4 plans">
    <div class="card mb-3" style="max-width: 20rem;min-height:1200px;background-color:transparent;color:black;border-color:black">
      <div class="card-header text-white">Профессиональный план</div>
        <div class="card-body">
			Идеально подходит для независимых блоггеров
<hr />
<p style="min-height:100px">
$25 в месяц / размещенный сайт. Лучшая рыночная стоимость для небольших команд или отдельных специалистов.
</p>

&nbsp;

<ul style="min-height:500px">

<li>Включенные ежемесячные ресурсы (на веб-сайт):
<p>
<ol>
  <li>Private Subversion хостинг с зеркалом GitHub</li>
  <li>250 МБ пространства для хранения<sup>1</sup></li>
  <li>100 ГБ передачи данных</li>
  <li>Неограниченное использование IDE на 10 мест</li>
  <li>100 минут сборки</li>
  <li>Поддержка клиентов по электронной почте</li>
</ol>
</p>
</li>
</ul>

<ul style="min-height:300px">
<li>Дополнительные ежемесячные тарифы на ресурсы (на веб-сайт):
<p>
<ol>
  <li>1 / 5 МБ памяти<sup>1</sup></li>
  <li>$10 / 40 ГБ передачи данных</li>
  <li>$5 / место</li>
  <li>$10 / 100 минут сборки</li>
  <li>$0,50 / страница AI NLP переводы</li>
</ol>
</p>
</li>
</ul>
</div>
</div>
</div>
<div class="col-lg-4 plans">
  <div class="card mb-3" style="max-width: 20rem;min-height:1200px;background-color:transparent;color:black;border-color:black">
    <div class="card-header text-white">Бизнес-план</div>
      <div class="card-body">
			Отлично подходит для малого и среднего бизнеса
<hr />
<p style="min-height:100px">
$100 / месяц / размещенный сайт, сэкономить $400 + от Confluence Premium!
</p>

&nbsp;

<ul style="min-height:500px">
<li>Включенные ежемесячные ресурсы (на веб-сайт):
<p>
<ol>
  <li>Частный хостинг Subversion</li>
  <li>1 ГБ пространства для хранения<sup>1</sup></li>
  <li>500 ГБ передачи данных</li>
  <li>Неограниченное использование IDE на 50 мест</li>
  <li>До 5 групп ACL</li>
  <li>500 минут сборки</li>
  <li>99,9% Комплексное соглашение об уровне обслуживания (SLA)<sup>3</sup></li>
  <li>Поддержка клиентов по электронной почте</li>
</ol>
</p>
</li>
</ul>
<ul style="min-height:300px">
<li>Дополнительные ежемесячные тарифы на ресурсы (на веб-сайт):
<p>
<ol>
  <li>10 / 100 МБ памяти<sup>1</sup></li>
  <li>$20 / 100 ГБ передачи данных</li>
  <li>$10 / место</li>
  <li>$10 / 100 минут сборки</li>
  <li>$0,40 / страница AI NLP переводы</li>
</ol>
</p>
</li>
</ul>
</div>
</div>
</div>
<div class="col-lg-4 plans">
<div class="card mb-3" style="max-width: 20rem;min-height:1200px;background-color:transparent;color:black;border-color:black">
  <div class="card-header text-white">План предприятия</div>
    <div class="card-body">
Фиксированная ставка для более чем 500 мест
<hr />
<p style="min-height:100px">
Свяжитесь с нами и экономьте $100K ежегодно
</p>

&nbsp;

<ul style="min-height:500px">
<li>Включенные ежемесячные ресурсы:

&nbsp;

<p>
<ol>
  <li>10 ГБ пространства для хранения в собственном репозитории Subversion<sup>2</sup></li>
  <li>Перенос данных объемом 5 ТБ</li>
  <li>Неограниченное количество сайтов и (самоуправляемых) мест</li>
  <li>5000 минут сборки</li>
  <li>Полный контроль над конфигурацией авторизации Subversion</li>
  <li>Частные, сетевые контейнеры сборки</li>
  <li>99,99% Комплексное соглашение об уровне обслуживания (SLA)<sup>3</sup></li>
  <li>Глобальный POP<sup>4</sup> с географически распределенной сетью доставки последней мили в Q4</li>
  <li>Премиум поддержка SLA</li>
</ol>
</p>
</li>
</ul>
<ul style="min-height:300px">
<li>Дополнительные ежемесячные ставки за ресурсы:

&nbsp;

<p>
<ol>
  <li>100 $ / 1 ГБ пространства для хранения<sup>2</sup></li>
  <li>$15 / 100 ГБ передачи данных</li>
  <li>$100 / ithread mod_perl хостинг реестра</li>
  <li>100 долларов США / регион OCI для пользовательских POP</li>
  <li>100 $ / 1K Минуты сборки</li>
  <li>$0,30 / страница AI NLP переводы</li>
  <li>WebSockets и/или частный хостинг контейнеров доступен</li>
</ol>
</p>
</li>
</ul>
</div>
</div>
</div>
</div>

- Все планы включают внутреннее автоматизированное управление сертификатами SSL/TLS (через LetsEncrypt), интегрированную поисковую систему PCRE (+Markdown), автоматизированный перевод на естественный язык (через ИИ OCI) и шлюз обработки форм электронной почты.

- Адаптация просто включает в себя предоставление структуры ссылки на меню верхней части и загрузочного 4 или загрузочного 5 css-файла для стилизации.

- {# lede #}Годовые предварительные ценовые скидки (до 20% от ежемесячных затрат на выставление счетов){# lede #}.

- Доступные скидки за объем.

- Корпоративные серверные установки Orion на базе Kerberos теперь доступны для клиентов, которым требуется альтернатива центру обработки данных Atlassian Confluence.

- Корпоративные клиенты могут включить ограничения сетевого брандмауэра для прямого доступа к своему репозиторию контроля версий.

- Функция OCI (бессерверная технология) / интеграция OCI RDBMS в ближайшее время.

- Консалтинговые услуги и услуги по созданию сайтов.

- Технологии Parnerships очень приветствуются для агентств и сторонних реселлеров.

### Создание минут и уровней плана: грубое руководство

*Разумная оценка высокого уровня для средней продолжительности сборки на фиксацию: [10 секунд](/dynamic/search/?regex=build=;lang={{lang}};markdown_search=1).*

- Профессионалы с менее чем 20 фиксациями в день должны быть в порядке с 100 минут сборки, включенных в план.

- Компании с менее чем 100 фиксациями в день должны быть в порядке с 500 минут сборки, включенных в план.

- Предприятия с менее чем 1000 фиксаций в день (достижение одной фиксации в минуту) должны быть в порядке с 5000 минут сборки, включенных в план.

- Builds that exceed a five minute duration are on the house: Мы рассматриваем эти инциденты как системные ошибки.

------------

#### Сноски

1.  Использование хранилища, рассчитанное на основе размера одной рабочей копии каждого сайта, но это не строго соблюдается на полях. 1-5% – это не то, о чем нужно беспокоиться. Более 5%? Поговорите с нами.

2. Использование хранилища, рассчитанное на основе общего размера репозитория Subversion на базе систем SunStar для корпоративных клиентов, а не для отдельных оформлений покупок.

3. SLA охватывает активы веб-сайтов *и *Orion Online IDE *и* доступность системы сборки, но исключает систему управления версиями Subversion, которая, как мы ожидаем, останется конкурентоспособной с показателями общей доступности GitHub.

4. Точки присутствия клиентов предприятия (POP):

- Форт-Лодердейл, FL

Вашингтон, округ Колумбия

- Феникс, Аризона

- Франкфурт, DE

- Сидней, Австралия

- Сан-Паулу, BZ

- Хайдарабад, IN

- Сеул, СК

------------

## Индекс

{% for d in deps %}
- [{{d.1.headers.title|safe}}]({{d.0}}) &mdash; {{d.1.content|lede}}
{% endfor %}

------------

<div class="col-lg-12">
  {% include "/enquiry_get.html"|append:lang %}
</div>

<style type="text/css">
h4 { font-size:14px }
@-webkit-keyframes FADEY {
  0%   { opacity: 0; }
  100% { opacity: 1; }
}

.theme-showcase {
	-webkit-animation-name: FADEY;
	-webkit-animation-duration: 2s;
	-webkit-animation-timing-function: ease-in-out;
	-webkit-animation-iteration-count: 1;
}

@keyframes plans {
  0% {
	top: 1000px;
	position:relative;
  }

100% {top: 5px;position:relative}

}

.plans {
	animation: plans;
    animation-duration: 2s;
    animation-timing-function: ease-out;
}
</style>

<!-- $Date$ $Author$ $Revision$ -->
